Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьКомпиляциюРегЭкспаВСтроку");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКомпиляциюРегЭкспаВРегЭксп");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКомпиляциюСложногоРегЭкспаВСтроку");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКомпиляциюКаналящегосяРегЭкспаВСтроку");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьАнглийскиеСинонимы");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьКомпиляциюРегЭкспаВСтроку() Экспорт

	ВербальноеВыражение = Новый ВербальноеВыражение();
	
	Результат = ВербальноеВыражение.ВСтроку();
	
	юТест.ПроверитьРавенство(Результат, "");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКомпиляциюРегЭкспаВРегЭксп() Экспорт

	ВербальноеВыражение = Новый ВербальноеВыражение();
	
	ВербальноеВыражение.ЧтоНибудьНоНе("№");
	Сообщить(ВербальноеВыражение.ВСтроку());
	Результат = ВербальноеВыражение.ВРегулярноеВыражение();
	
	юТест.ПроверитьРавенство(ТипЗнч(Результат), Тип("РегулярноеВыражение"));
	юТест.ПроверитьИстину(Результат.Совпадает("КакоеТоСлово"));
	юТест.ПроверитьЛожь(Результат.Совпадает("№"));
	

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКомпиляциюСложногоРегЭкспаВСтроку() Экспорт

	ВербальноеВыражение = Новый ВербальноеВыражение();
	
	ВербальноеВыражение.Слово();
	Результат = ВербальноеВыражение.ВСтроку();
	
	юТест.ПроверитьРавенство(Результат, "\w+");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКомпиляциюКаналящегосяРегЭкспаВСтроку() Экспорт

	ВербальноеВыражение = Новый ВербальноеВыражение();
	
	Результат = Новый ВербальноеВыражение()
	    .НачалоСтроки()
	    .ЧтоУгодноНоНе("123")
	    .ЧтоУгодно()
	    .Слово()
	    .МожетБыть("раз-два-три")
	    .Слово()
	    .КонецСтроки()
	    .ВСтроку();
	
	юТест.ПроверитьРавенство(Результат, "^([^123]*)(.*)\w+(раз-два-три)?\w+$");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьАнглийскиеСинонимы() Экспорт

	ВербальноеВыражение = Новый VerbalExpression();
	
	ВербальноеВыражение.Word();
	Результат = ВербальноеВыражение.ToString();
	
	юТест.ПроверитьРавенство(Результат, "\w+");

КонецПроцедуры